# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
col1 = pd.Series(np.random.randint(1, 5, 100))
col2 = pd.Series(np.random.randint(1, 4, 100))
col3 = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.DataFrame({'col1': col1, 'col2': col2, 'col3': col3})
df.head()

   col1  col2   col3
0     1     3  25089
1     2     3  23869
2     1     1  21145
3     2     3  10304
4     2     1  17282

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.concat([col1, col2, col3], axis=0).to_frame()

bigcolumn

        0
0       1
1       2
2       1
3       2
4       2
..    ...
95  26496
96  12457
97  28082
98  20427
99  17933

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
bigcolumn.tail()

        0
95  26496
96  12457
97  28082
98  20427
99  17933

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
bigcolumn.reset_index()

     index      0
0        0      1
1        1      2
2        2      1
3        3      2
4        4      2
..     ...    ...
295     95  26496
296     96  12457
297     97  28082
298     98  20427
299     99  17933

[300 rows x 2 columns]